{
  "backend/main.mo": "Defines core Motoko types for users, memberships, publishing works, releases, recording projects, and artist development, including status enums and linking structures.",
  "feature_evidence.json": "Reports feature evidence for rollout 21.7 and smoke‑test validation, listing involved files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend modules focused on upgrade‑safe rendering, link management, and related‑records UI behavior.",
  "frontend/index.css": "Tailwind-based global stylesheet defining CSS variables and theming for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point that loads the frontend app via a root div and main.tsx module script.",
  "frontend/ROLL_OUT_21_7_EXECUTION_LOG.md": "Template log for documenting execution evidence of the 21.7 rollout build, upgrade, and deployment validation steps.",
  "frontend/ROLLOUT_STEPS.md": "Outlines all rollout steps with detailed instructions for upgrade‑safe linking verification and upcoming build/upgrade readiness tasks.",
  "frontend/SMOKE_TEST_21_1_21_2.md": "Checklist for verifying core app functionality and detail pages after rollout 21.1–21.2 canister upgrades.",
  "frontend/SMOKE_TEST_21_3_21_4.md": "Smoke‑test checklist for rollout 21.3–21.4 focusing on upgrade resilience and validation of detail pages and Edit Links dialogs.",
  "frontend/SMOKE_TEST_21_5_21_6.md": "Smoke test checklist for rollout 21.5–21.6 verifying frontend loading, authentication, five detail routes, and Edit Links dialogs for admin and non-admin roles.",
  "frontend/SMOKE_TEST_21_7_SESSION_LOG.md": "Session log template for recording detailed results of the 21.7 smoke test, including principals, IDs, console errors, and per-role outcomes.",
  "frontend/SMOKE_TEST_21_7.md": "Smoke test checklist for rollout 21.7 including role-based testing, detail route verification, and Edit Links dialog checks with recorded entity IDs.",
  "frontend/src/App.tsx": "Sets up the React Router structure, root error handling, and portal routing with authentication and approval gates.",
  "frontend/src/components/auth/ApprovalGate.tsx": "Blocks access until a user is approved, showing pending UI and allowing approval requests.",
  "frontend/src/components/auth/AuthGate.tsx": "Protects routes by requiring authentication and redirects or shows sign‑in UI when needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a sign‑in/sign‑out button tied to Internet Identity with session clearing logic.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Prompts new authenticated users to complete their profile and submits profile data.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Displays an access‑denied message with guidance when a user lacks permissions.",
  "frontend/src/components/feedback/EmptyState.tsx": "Shows an empty‑state screen with optional icon and action button.",
  "frontend/src/components/feedback/ErrorBanner.tsx": "Renders a user‑friendly error alert with basic message mapping.",
  "frontend/src/components/feedback/LoadingState.tsx": "Shows a full‑screen skeleton loading indicator.",
  "frontend/src/components/layout/BrandHeader.tsx": "Displays the site header with navigation to home and optional auth button.",
  "frontend/src/components/layout/PortalLayout.tsx": "Provides the portal UI layout with sidebar navigation, header, and role‑aware menu items.",
  "frontend/src/components/related/EditLinksButton.tsx": "Simple button component for triggering link‑editing actions.",
  "frontend/src/components/related/EditRelatedDialog.tsx": "Modal dialog for editing related entity links, handling loading, errors, and multi-select lists for each entity type.",
  "frontend/src/components/related/MultiSelectList.tsx": "Filtered multi-select list with search, checkboxes, and count tracking for selecting related entity IDs.",
  "frontend/src/components/related/relatedRecordsPermissions.ts": "Provides permission checks determining whether a user can edit records or memberships based on identity or admin status.",
  "frontend/src/components/related/RelatedRecordsSection.tsx": "Displays linked record badges with label resolution based on user role and caller-accessible entities.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches and exposes the current user's role, admin status, approval state, and loading state using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including loading, login, logout, and identity persistence.",
  "frontend/src/hooks/useLinkableEntityOptions.ts": "Provides a hook that returns normalized selectable entity lists for admins or non-admins based on query data and loading/error states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, approvals, and various domain entities via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines light/dark theme CSS variables for the application's color system.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public landing page with hero content, service descriptions, and Internet Identity sign‑in flow.",
  "frontend/src/pages/portal/admin/AdminBootstrapPage.tsx": "Explains how to initialize the first admin account using a secret token passed through the URL.",
  "frontend/src/pages/portal/admin/AdminDashboardPage.tsx": "Displays admin-only stats, recent items, and links to entity management pages, loading data via multiple admin queries.",
  "frontend/src/pages/portal/admin/RoleAssignmentPage.tsx": "Admin-only page that lists authenticated users and lets administrators assign roles with immediate updates.",
  "frontend/src/pages/portal/artists/ArtistDevelopmentDetail.tsx": "Displays detailed artist development data, handles related-entity linking, and allows editing based on permissions.",
  "frontend/src/pages/portal/artists/ArtistDevelopmentPage.tsx": "Shows all artist development entries and provides an admin-only dialog to create new records.",
  "frontend/src/pages/portal/label/ReleaseDetail.tsx": "Shows release details, normalizes arrays, and supports editing related links when permitted.",
  "frontend/src/pages/portal/label/ReleasesPage.tsx": "Lists all releases and offers an admin-only form dialog to create new release entries.",
  "frontend/src/pages/portal/memberships/MembershipDetail.tsx": "Displays and edits a single membership profile, including profile fields, status, and related entity links using query and mutation hooks.",
  "frontend/src/pages/portal/memberships/MembershipsPage.tsx": "Lists all membership profiles and allows admins to create new memberships via a dialog form.",
  "frontend/src/pages/portal/publishing/PublishingWorkDetail.tsx": "Shows detailed information for a publishing work, supports editing notes, and manages related linked entities.",
  "frontend/src/pages/portal/publishing/PublishingWorksPage.tsx": "Displays the publishing catalog and provides a form for admins to create new publishing works with ownership split validation.",
  "frontend/src/pages/portal/recordings/RecordingProjectDetail.tsx": "Shows recording project details, including participants and linked entities, and allows editing of related record associations.",
  "frontend/src/pages/portal/recordings/RecordingProjectsPage.tsx": "React page listing recording projects, with admin-only dialog to create new projects and form handling for project fields.",
  "frontend/src/utils/arrays.ts": "Provides safe array utilities for normalizing unknown values to arrays and checking lengths and non-empty status.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL.",
  "frontend/src/utils/validation.ts": "Validates ownership split percentages, ensuring totals are within 0–100%.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended theme settings, custom colors, fonts, keyframes, and plugins.",
  "frontend/UPGRADE_LINKING_VERIFICATION_RESULTS.md": "Results template for recording upgrade-safe linking verification and smoke test outcomes across multiple rollout versions.",
  "frontend/UPGRADE_LINKING_VERIFICATION.md": "Manual QA checklist verifying upgrade-safe related-record linking across all entity detail pages for both admin and non-admin users.",
  "project_state.json": "Tracks project metadata, rollout history, known issues, and implemented features for the Higgins Music platform."
}