{
  "backend/main.mo": "Defines actor types for users and all entity domains, including membership, publishing, label, recording, and artist development models with supporting enums and helpers.",
  "feature_evidence.json": "Lists feature evidence entries mapping rollout tasks to impacted files, components, and test IDs for upgrade validation.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing frontend components, hooks, and pages focused on upgrade-safe array handling and linking logic.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, dark mode tokens, and base styling for the app.",
  "frontend/index.html": "Basic HTML entry point that mounts the app root and loads main.tsx.",
  "frontend/ROLLOUT_STEPS.md": "Documents rollout steps including upgrade-safe linking verification and preparation tasks for upcoming builds.",
  "frontend/SMOKE_TEST_21_1_21_2.md": "Provides a smoke test checklist to validate core routes, authentication, and Edit Links dialogs after rollout 21.1–21.2 upgrades.",
  "frontend/SMOKE_TEST_21_3_21_4.md": "Provides the smoke test checklist for rollout 21.3–21.4, confirming route stability and Edit Links dialog behavior for admin and member roles.",
  "frontend/SMOKE_TEST_21_5_21_6.md": "Smoke test checklist for verifying portal loading, detail routes, and Edit Links dialogs after rollout 21.5–21.6.",
  "frontend/SMOKE_TEST_21_7.md": "Smoke test checklist for rollout 21.7 covering portal access, authorization gates, detail route rendering, and Edit Links dialogs.",
  "frontend/src/App.tsx": "React router setup defining routes, layout, auth gates, error components, and page components for the portal.",
  "frontend/src/components/auth/ApprovalGate.tsx": "Checks user approval and admin status, showing a pending-approval screen or allowing access to children accordingly.",
  "frontend/src/components/auth/AuthGate.tsx": "Redirects unauthenticated users and displays a sign‑in prompt while protecting gated routes.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a sign‑in/sign‑out button that manages Internet Identity auth state and clears cached queries on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a mandatory profile setup dialog for new authenticated users and submits basic profile data.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Displays an access‑denied message with an optional custom message in a styled card.",
  "frontend/src/components/feedback/EmptyState.tsx": "Renders a generic empty‑state view with optional icon and action button.",
  "frontend/src/components/feedback/ErrorBanner.tsx": "Shows a destructive alert with friendly error messaging based on backend error text.",
  "frontend/src/components/feedback/LoadingState.tsx": "Displays a full‑screen skeleton loader for page‑level loading states.",
  "frontend/src/components/layout/BrandHeader.tsx": "Renders the top navigation header with branding and an optional login button.",
  "frontend/src/components/layout/PortalLayout.tsx": "Provides the authenticated portal layout with sidebar navigation, mobile toggle, and dynamic admin links.",
  "frontend/src/components/related/EditLinksButton.tsx": "Simple button component for initiating editing of related entity links.",
  "frontend/src/components/related/EditRelatedDialog.tsx": "Dialog for selecting and saving related entity IDs with loading, error, and multi‑category selection support.",
  "frontend/src/components/related/MultiSelectList.tsx": "Filterable multiselect list allowing users to select entity IDs with checkboxes and scrolling.",
  "frontend/src/components/related/relatedRecordsPermissions.ts": "Provides permission checks for editing records or memberships based on identity, admin status, and ownership.",
  "frontend/src/components/related/RelatedRecordsSection.tsx": "Displays related record links with role-based label resolution and defensive normalization for missing data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's role and approval status using the actor, exposing admin and loading state flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook to manage login, stored identities, and authentication state.",
  "frontend/src/hooks/useLinkableEntityOptions.ts": "Builds lists of linkable entity options for admins or callers, normalizing records and handling query modes.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks for user profiles, roles, approvals, and entity CRUD operations via the actor.",
  "frontend/src/index.css": "Sets Tailwind layers and defines a warm neutral theme with light and dark mode CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider before rendering App.",
  "frontend/src/pages/LandingPage.tsx": "Landing page that redirects authenticated users to the portal and displays marketing sections with a sign‑in button.",
  "frontend/src/pages/portal/admin/AdminBootstrapPage.tsx": "Explains and displays instructions for initializing the first admin via a secret token in the URL.",
  "frontend/src/pages/portal/admin/AdminDashboardPage.tsx": "Admin dashboard showing counts and recent items across multiple entities with navigation to management pages.",
  "frontend/src/pages/portal/admin/RoleAssignmentPage.tsx": "Allows administrators to view known users and assign or change their roles via a role‑selection interface.",
  "frontend/src/pages/portal/artists/ArtistDevelopmentDetail.tsx": "Displays details for a single artist‑development entry with related‐entity linking and edit capabilities based on permissions.",
  "frontend/src/pages/portal/artists/ArtistDevelopmentPage.tsx": "Lists all artist‑development entries and lets admins create new entries via a dialog form.",
  "frontend/src/pages/portal/label/ReleaseDetail.tsx": "Displays detailed release info, permissions, normalized fields, and manages editing of related linked entities.",
  "frontend/src/pages/portal/label/ReleasesPage.tsx": "Lists all releases and provides an admin-only dialog to create new releases with basic metadata.",
  "frontend/src/pages/portal/memberships/MembershipDetail.tsx": "Shows membership profile details, allows editing profile and linked entities, and normalizes related arrays.",
  "frontend/src/pages/portal/memberships/MembershipsPage.tsx": "Lists membership profiles with status indicators and includes an admin-only form to create new memberships.",
  "frontend/src/pages/portal/publishing/PublishingWorkDetail.tsx": "Displays publishing work details, supports adding notes and editing linked entities, and normalizes related arrays.",
  "frontend/src/pages/portal/publishing/PublishingWorksPage.tsx": "Admin page for listing publishing works and creating new ones with validation of contributor ownership splits.",
  "frontend/src/pages/portal/recordings/RecordingProjectDetail.tsx": "Displays detailed info for a recording project, normalizes linked entity arrays, and allows admins to edit related links.",
  "frontend/src/pages/portal/recordings/RecordingProjectsPage.tsx": "Lists recording projects and provides an admin dialog to create new projects with participants, dates, and status.",
  "frontend/src/utils/arrays.ts": "Utility helpers for safely normalizing, checking, and handling array-like values to avoid undefined/null issues.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/validation.ts": "Validates ownership split arrays, ensuring totals are non-negative and do not exceed 100%.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "frontend/UPGRADE_LINKING_VERIFICATION_RESULTS.md": "Template for recording manual QA and smoke test results after upgrade, including user info, route checks, and error notes.",
  "frontend/UPGRADE_LINKING_VERIFICATION.md": "Manual QA checklist to verify upgrade-safe related-record linking across all detail pages for admins and members.",
  "project_state.json": "Tracks project version, notes on requested build/deploy steps, existing features, and known pipeline issues for the Higgins Music platform."
}