{
  "backend/main.mo": "Defines the main actor with comprehensive types for users, memberships, publishing, label releases, recording projects, and artist development, including migration integration.",
  "backend/migration.mo": "Provides legacy type definitions and a migration runner for upgrading stored canister data between versions.",
  "feature_evidence.json": "Lists rollout 21.7 feature evidence, including related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files related to upgrade‑safe rendering and linking functionality.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/ROLL_OUT_21_7_EXECUTION_LOG.md": "Records timestamped evidence of rollout 21.7 build, verification steps, and canister upgrade execution.",
  "frontend/ROLL_OUT_21_7_STEP_9_5_ARTIFACTS.md": "Stores raw command outputs and build artifacts referenced during rollout 21.7 execution.",
  "frontend/ROLLOUT_STEPS.md": "Outlines the full rollout plan with detailed steps for upgrade validation and cross-link QA procedures.",
  "frontend/SMOKE_TEST_21_1_21_2.md": "Smoke test checklist for rollout 21.1–21.2 verifying landing page load, authentication, five detail routes, and Edit Links dialogs for admin and member roles.",
  "frontend/SMOKE_TEST_21_3_21_4.md": "Smoke test for rollout 21.3–21.4 confirming navigation, detail route stability, and Edit Links dialog behavior for admin and non‑admin users.",
  "frontend/SMOKE_TEST_21_5_21_6.md": "Smoke test for rollout 21.5–21.6 ensuring all five detail routes and Edit Links dialogs function correctly for both user roles after upgrade.",
  "frontend/SMOKE_TEST_21_7_SESSION_LOG.md": "Session log template for recording principals, IDs, console output, and pass/fail results during the 21.7 smoke test.",
  "frontend/SMOKE_TEST_21_7.md": "Expanded smoke test for rollout 21.7 emphasizing AuthGate/ApprovalGate behavior, two‑role testing, and detailed entity ID logging.",
  "frontend/src/App.tsx": "Configures the application's route tree, error boundaries, and portal layout with auth gating.",
  "frontend/src/components/auth/ApprovalGate.tsx": "Blocks access until user approval status is confirmed, showing a pending screen and approval request flow.",
  "frontend/src/components/auth/AuthGate.tsx": "Requires Internet Identity authentication, redirecting unauthenticated users and showing sign‑in UI.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a sign‑in/sign‑out button integrated with Internet Identity and React Query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Prompts new authenticated users to complete their profile before entering the portal.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Displays an access‑denied message when a user lacks required permissions.",
  "frontend/src/components/feedback/EmptyState.tsx": "Reusable empty‑state component with optional icon and action callback.",
  "frontend/src/components/feedback/ErrorBanner.tsx": "Shows user‑friendly error messages, including mapped backend authorization and not‑found errors.",
  "frontend/src/components/feedback/LoadingState.tsx": "Full‑screen loading skeleton used while data or auth state is loading.",
  "frontend/src/components/layout/BrandHeader.tsx": "Top navigation header with logo, home navigation, and optional authentication button.",
  "frontend/src/components/layout/PortalLayout.tsx": "Provides the portal layout with a sidebar, mobile menu, and navigation items conditioned on admin status.",
  "frontend/src/components/related/EditLinksButton.tsx": "Renders a button for opening link-editing actions, with optional disabled state.",
  "frontend/src/components/related/EditRelatedDialog.tsx": "Displays a dialog for editing related entity links, handling loading, errors, and multi-select lists.",
  "frontend/src/components/related/MultiSelectList.tsx": "Implements a searchable multi-select list with checkboxes and filtering.",
  "frontend/src/components/related/relatedRecordsPermissions.ts": "Defines permission checks for editing records or memberships based on identity, ownership, and admin status.",
  "frontend/src/components/related/RelatedRecordsSection.tsx": "Shows related records with labels resolved based on user role, or a placeholder when none exist.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's role and approval status using the actor, exposing admin and loading state flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, and clearing identities.",
  "frontend/src/hooks/useLinkableEntityOptions.ts": "Builds linkable entity option lists for admins or regular users by querying various entity types and normalizing results.",
  "frontend/src/hooks/useQueries.ts": "Defines numerous React Query hooks for fetching and mutating backend data such as profiles, roles, approvals, and memberships.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and theme variables for light and dark modes with a warm neutral palette.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/LandingPage.tsx": "Landing page presenting marketing content and a sign‑in button that redirects authenticated users to the portal.",
  "frontend/src/pages/portal/admin/AdminBootstrapPage.tsx": "Admin bootstrap instructions explaining how to initialize the first admin account using a secret token in the URL.",
  "frontend/src/pages/portal/admin/AdminDashboardPage.tsx": "Admin overview page that loads counts and recent items for all major entity types and displays access-controlled dashboard stats.",
  "frontend/src/pages/portal/admin/RoleAssignmentPage.tsx": "Admin-only UI for viewing all known users and assigning or changing their roles with immediate updates.",
  "frontend/src/pages/portal/artists/ArtistDevelopmentDetail.tsx": "Displays a single artist development entry with editable linked entities and normalized fields, if permissions allow.",
  "frontend/src/pages/portal/artists/ArtistDevelopmentPage.tsx": "Lists all artist development entries and allows admins to create new ones via a dialog form.",
  "frontend/src/pages/portal/label/ReleaseDetail.tsx": "Shows detailed release information with editable linked entities and normalized arrays based on user permissions.",
  "frontend/src/pages/portal/label/ReleasesPage.tsx": "Lists all label releases, shows loading or empty states, and allows admins to create new releases via a dialog form. Handles form parsing and mutation for creating releases.",
  "frontend/src/pages/portal/memberships/MembershipDetail.tsx": "Displays detailed membership info with editable profile fields, related-entity linking, and role-based permissions. Supports updating membership data and managing linked records.",
  "frontend/src/pages/portal/memberships/MembershipsPage.tsx": "Shows a list of membership profiles with status badges and navigation. Admins can create new membership profiles through a modal form.",
  "frontend/src/pages/portal/publishing/PublishingWorkDetail.tsx": "Shows detailed publishing work info, editable notes, and linked entities with permission checks. Supports saving notes and updating related entity links.",
  "frontend/src/pages/portal/publishing/PublishingWorksPage.tsx": "Lists all publishing works and allows admins to create new works with contributor and ownership-split validation. Displays loading and empty states and handles creation via a dialog form.",
  "frontend/src/pages/portal/recordings/RecordingProjectDetail.tsx": "Displays details for a single recording project, including related entities, editing permissions, and link management via dialogs and mutations.",
  "frontend/src/pages/portal/recordings/RecordingProjectsPage.tsx": "Lists all recording projects and provides an admin-only dialog to create new projects.",
  "frontend/src/utils/arrays.ts": "Provides utility helpers for safely normalizing, validating, and inspecting array-like values.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/src/utils/validation.ts": "Validates ownership split arrays ensuring totals are within allowed bounds.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom themes, colors, fonts, animations, and plugins.",
  "frontend/UPGRADE_LINKING_VERIFICATION_RESULTS.md": "Manual QA checklist for verifying upgrade-safe linking across portal pages for multiple rollouts.",
  "frontend/UPGRADE_LINKING_VERIFICATION.md": "Manual QA checklist for verifying post‑upgrade Edit Links functionality across all five detail pages for admin and non‑admin users.",
  "project_state.json": "Tracks project schema version, rollout steps, feature history, and known issues for the build process."
}