{
  "backend/main.mo": "Defines the main actor with all entity types, status enums, and cross-linked data structures for memberships, publishing, releases, recordings, and artist development.",
  "backend/migration.mo": "Provides type-aligned migration logic where the upgrade function simply returns the old actor state unchanged.",
  "feature_evidence.json": "Lists feature evidence records referencing frontend files, components, and test IDs for upgrade-resilient linking functionality.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files related to linking, permissions, dialogs, and detail pages.",
  "frontend/index.css": "Tailwind CSS setup defining global theme variables, colors, and dark mode styles.",
  "frontend/index.html": "Base HTML document loading the React application root and main TypeScript entry point.",
  "frontend/src/App.tsx": "Configures the application's router and protected portal routes with nested pages and authentication gates.",
  "frontend/src/components/auth/ApprovalGate.tsx": "Blocks access for non‑approved users and provides an approval request UI unless the user is an admin.",
  "frontend/src/components/auth/AuthGate.tsx": "Redirects unauthenticated users to the landing page and shows a sign‑in prompt when needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a sign‑in/sign‑out button that manages Internet Identity login flow and clears cached queries.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal requiring new authenticated users to submit their profile before accessing the portal.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Displays an access‑denied message with guidance for contacting an administrator.",
  "frontend/src/components/feedback/EmptyState.tsx": "Reusable empty‑state component with optional icon and action button.",
  "frontend/src/components/feedback/ErrorBanner.tsx": "Shows a formatted error alert and converts certain backend errors into friendly messages.",
  "frontend/src/components/feedback/LoadingState.tsx": "Displays a skeleton‑based full‑screen loading placeholder.",
  "frontend/src/components/layout/BrandHeader.tsx": "Top navigation header with branding, home navigation, and optional auth button.",
  "frontend/src/components/layout/PortalLayout.tsx": "Defines the portal's page layout with a sidebar, navigation items, and responsive mobile menu.",
  "frontend/src/components/related/EditLinksButton.tsx": "Simple button component that triggers editing of related entity links.",
  "frontend/src/components/related/EditRelatedDialog.tsx": "Modal dialog for selecting and saving related entity IDs with loading and error handling.",
  "frontend/src/components/related/MultiSelectList.tsx": "Provides a searchable multi-select list component with checkboxes and filtered options.",
  "frontend/src/components/related/relatedRecordsPermissions.ts": "Implements permission checks for editing records based on identity, admin status, and ownership.",
  "frontend/src/components/related/RelatedRecordsSection.tsx": "Displays related record IDs with label resolution based on user role and caller entity data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches caller role and approval status using the actor and exposes user state flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useLinkableEntityOptions.ts": "Builds linkable entity option lists for admins or non-admins using normalized backend or caller entity data.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating profiles, approvals, memberships, works, releases, and projects.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light/dark theme CSS variables for colors and layout.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, service descriptions, and Internet Identity sign‑in flow redirecting to the portal.",
  "frontend/src/pages/portal/admin/AdminBootstrapPage.tsx": "Explains and displays instructions for initializing the first admin account using a secret token.",
  "frontend/src/pages/portal/admin/AdminDashboardPage.tsx": "Admin dashboard showing system-wide stats and recent items, with access control and loading states.",
  "frontend/src/pages/portal/artists/ArtistDevelopmentDetail.tsx": "Displays and manages a single artist development entry, including editable related links and permissions.",
  "frontend/src/pages/portal/artists/ArtistDevelopmentPage.tsx": "Lists artist development entries and provides an admin-only dialog to create new entries.",
  "frontend/src/pages/portal/label/ReleaseDetail.tsx": "Displays release details, fetches and normalizes linked entities, and allows editing related records if user permissions allow.",
  "frontend/src/pages/portal/label/ReleasesPage.tsx": "Lists all releases with admin‑only creation dialog, handling form submission and navigation to individual release pages.",
  "frontend/src/pages/portal/memberships/MembershipDetail.tsx": "Shows membership profile details, supports editing profile fields and managing related entity links with permission checks.",
  "frontend/src/pages/portal/memberships/MembershipsPage.tsx": "Lists all membership profiles and provides an admin‑only dialog to create new member records.",
  "frontend/src/pages/portal/publishing/PublishingWorkDetail.tsx": "Loads publishing work details, supports adding notes and editing linked entities, and enforces edit permissions.",
  "frontend/src/pages/portal/publishing/PublishingWorksPage.tsx": "Lists publishing works, allows admins to create new ones with validation for contributors and ownership splits.",
  "frontend/src/pages/portal/recordings/RecordingProjectDetail.tsx": "Displays detailed recording project info, handles linkable entity editing, and normalizes related arrays.",
  "frontend/src/pages/portal/recordings/RecordingProjectsPage.tsx": "Shows all recording projects and provides an admin dialog to create new projects with session data and status.",
  "frontend/src/utils/arrays.ts": "Provides safe array normalization utilities for handling undefined or legacy backend values.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/src/utils/validation.ts": "Validates ownership split arrays ensuring totals are within allowed percentage limits.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme styles, colors, animations, and enabling typography and container queries plugins.",
  "frontend/UPGRADE_LINKING_VERIFICATION.md": "Manual checklist describing how to verify post-upgrade related‑record linking across all entity detail pages for admin and non‑admin users.",
  "project_state.json": "Tracks project version, architectural notes, issues, and a list of implemented features for the Higgins Music platform. Contains metadata about modules like membership, publishing, label operations, and recordings."
}