{
  "backend/main.mo": "Defines core types and structures for users, membership, publishing works, releases, recording projects, and artist development entities. Includes membership status utilities and shared actor-type definitions used across the backend.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected files, components, and test IDs. Serves as a traceability record for rollout-related changes.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files describing upgrade-hardening, related-records handling, and query normalization behavior. Acts as a reference index for frontend component purposes.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS custom properties for light and dark themes.",
  "frontend/index.html": "HTML entrypoint loading the root container and main.tsx module.",
  "frontend/ROLL_OUT_21_7_EXECUTION_LOG.md": "Provides timestamped evidence and logs for Rollout 21.7 Step 9.5 execution, including build, upgrade, and validation steps. Documents environment details and pre‑deployment checks.",
  "frontend/ROLL_OUT_21_7_STEP_9_5_ARTIFACTS.md": "Stores raw build and command outputs referenced by the main 21.7 execution log. Serves as an artifact repository for long log data.",
  "frontend/ROLLOUT_STEPS.md": "Outlines completed and remaining rollout steps, including detailed Step 10 deployment and smoke‑test requirements. Serves as the master rollout plan for the Higgins Music Hub.",
  "frontend/SMOKE_TEST_21_1_21_2.md": "Checklist for smoke testing after Rollout 21.1–21.2 focusing on route loading, authentication, and Edit Links dialog verification. Covers admin and non‑admin scenarios across all entity types.",
  "frontend/SMOKE_TEST_21_3_21_4.md": "Checklist for smoke testing after Rollout 21.3–21.4 with emphasis on upgrade‑safe rendering and Edit Links dialogs. Validates functionality for admin and non‑admin users across all five detail routes.",
  "frontend/SMOKE_TEST_21_5_21_6.md": "Smoke test checklist for rollout 21.5–21.6 verifying frontend load, authentication, detail routes, and Edit Links dialogs for admin and non-admin users.",
  "frontend/SMOKE_TEST_21_7_SESSION_LOG.md": "Session log template for recording principals, entity IDs, console output, and pass/fail results during the rollout 21.7 smoke test.",
  "frontend/SMOKE_TEST_21_7.md": "Expanded smoke test for rollout 21.7 covering both roles, authorization gates, and validation of all five portal detail routes with ID logging.",
  "frontend/SMOKE_TEST_STEP_10_MAINNET.md": "Mainnet post-deployment smoke test checklist confirming production readiness, authentication, authorization, and portal detail routes for both user roles.",
  "frontend/src/App.tsx": "Sets up TanStack router routes, layout structure, and global error handling for the app.",
  "frontend/src/components/auth/ApprovalGate.tsx": "Gates access based on user approval status and allows users to request approval.",
  "frontend/src/components/auth/AuthGate.tsx": "Protects routes by checking authentication via Internet Identity and redirecting unauthenticated users.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with fallback logic.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting new users to complete their profile and saves profile data.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Displays an access-denied card with an optional custom message.",
  "frontend/src/components/feedback/EmptyState.tsx": "Generic empty-state component with optional icon and action button.",
  "frontend/src/components/feedback/ErrorBanner.tsx": "Error banner that maps backend errors to user‑friendly messages.",
  "frontend/src/components/feedback/LoadingState.tsx": "Full‑screen skeleton loader used during data or auth loading.",
  "frontend/src/components/layout/BrandHeader.tsx": "Top navigation header with logo and optional authentication button.",
  "frontend/src/components/layout/PortalLayout.tsx": "Main portal layout with sidebar navigation, header, and mobile menu support.",
  "frontend/src/components/related/EditLinksButton.tsx": "Button component for triggering link-editing actions.",
  "frontend/src/components/related/EditRelatedDialog.tsx": "Dialog component for editing related entity links, handling loading, errors, and multi-select lists for various entity types.",
  "frontend/src/components/related/MultiSelectList.tsx": "Searchable multi-select list with filtering and checkbox selection for entity options.",
  "frontend/src/components/related/relatedRecordsPermissions.ts": "Utility functions determining edit permissions based on identity, admin status, and record ownership.",
  "frontend/src/components/related/RelatedRecordsSection.tsx": "Displays linked record summaries with label resolution based on user permissions, falling back to raw IDs.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Hook fetching the current user's role and approval status via the actor, exposing admin and loading flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useLinkableEntityOptions.ts": "Provides a hook that returns linkable entity option lists, choosing between admin-wide data or caller-specific data with loading and error states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, approvals, and various entity types via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind CSS and defines custom color variables and theming for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, configuring the React Query client and Internet Identity provider.",
  "frontend/src/pages/LandingPage.tsx": "Renders the marketing landing page with a hero section, services overview, and login flow redirect.",
  "frontend/src/pages/portal/admin/AdminBootstrapPage.tsx": "Explains how to bootstrap the first admin account using a secret token in the URL.",
  "frontend/src/pages/portal/admin/AdminDashboardPage.tsx": "Displays admin-only stats and recent items for memberships, works, releases, projects, and artists with loading and access control.",
  "frontend/src/pages/portal/admin/RoleAssignmentPage.tsx": "Admin-only page listing all known users and allowing role changes via a select control with immediate mutation updates.",
  "frontend/src/pages/portal/artists/ArtistDevelopmentDetail.tsx": "Displays a single artist development entry with related records and allows link editing based on user permissions.",
  "frontend/src/pages/portal/artists/ArtistDevelopmentPage.tsx": "Shows all artist development entries and lets admins create new ones through a dialog form.",
  "frontend/src/pages/portal/label/ReleaseDetail.tsx": "Detail view for a release with normalized fields, related-record linking, and edit permissions.",
  "frontend/src/pages/portal/label/ReleasesPage.tsx": "Lists all releases and provides an admin-only dialog to create new release entries.",
  "frontend/src/pages/portal/memberships/MembershipDetail.tsx": "Displays and edits a single membership profile, including status, related entities, and link management with role-based permissions.",
  "frontend/src/pages/portal/memberships/MembershipsPage.tsx": "Lists all membership profiles and allows admins to create new ones through a dialog form.",
  "frontend/src/pages/portal/publishing/PublishingWorkDetail.tsx": "Shows detailed publishing work information, supports editing notes, and manages links to related entities with permissions.",
  "frontend/src/pages/portal/publishing/PublishingWorksPage.tsx": "Displays the publishing catalog and provides an admin-only form to create new works with contributors and ownership splits.",
  "frontend/src/pages/portal/recordings/RecordingProjectDetail.tsx": "Shows details for a recording project and allows editing of related links, with role-based edit restrictions.",
  "frontend/src/pages/portal/recordings/RecordingProjectsPage.tsx": "React page that lists recording projects, shows loading state, and lets admins create new projects via a dialog form.",
  "frontend/src/utils/arrays.ts": "Utility helpers for safely normalizing and validating array-like values to avoid undefined/null issues.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL/hash.",
  "frontend/src/utils/validation.ts": "Validates ownership split percentages, ensuring totals are non-negative and do not exceed 100.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "frontend/UPGRADE_LINKING_VERIFICATION_RESULTS.md": "Template for documenting results of upgrade-safe linking tests and smoke tests across multiple rollouts, including failures and route status.",
  "frontend/UPGRADE_LINKING_VERIFICATION.md": "Manual QA checklist for verifying upgrade-safe related-record linking across all detail pages for admin and non-admin users.",
  "project_state.json": "Stores project metadata, rollout history, known issues, and implemented features for the Higgins Music platform."
}