{
  "backend/main.mo": "Defines core backend types for users, memberships, publishing works, label releases, recording projects, and artist development entities, including status enums and linked-entity relationships.",
  "feature_evidence.json": "Lists feature evidence entries mapping rollout steps to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend source files covering hooks, components, pages, and verification documents.",
  "frontend/index.css": "Tailwind CSS setup defining color, layout, and theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML entrypoint loading the root element and main React module.",
  "frontend/ROLLOUT_STEPS.md": "Single-source rollout plan listing completed and remaining steps with descriptions, verification instructions, and acceptance criteria.",
  "frontend/src/App.tsx": "Defines the root TanStack Router setup, including authentication-protected portal routes and all portal page routes.",
  "frontend/src/components/auth/ApprovalGate.tsx": "Gates access based on user approval status and lets non-approved users request admin approval.",
  "frontend/src/components/auth/AuthGate.tsx": "Redirects unauthenticated users and provides a sign‑in prompt using Internet Identity.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a sign‑in/sign‑out button using Internet Identity with automatic session handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Displays a forced modal for new users to complete their profile and saves the submitted info.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Renders a styled message indicating insufficient permissions.",
  "frontend/src/components/feedback/EmptyState.tsx": "Shows a reusable empty‑state view with optional icon and action button.",
  "frontend/src/components/feedback/ErrorBanner.tsx": "Displays an error alert with friendly messages for common backend errors.",
  "frontend/src/components/feedback/LoadingState.tsx": "Shows a skeleton-based full‑screen loading placeholder.",
  "frontend/src/components/layout/BrandHeader.tsx": "Top navigation header with logo and optional authentication button.",
  "frontend/src/components/layout/PortalLayout.tsx": "Provides the portal’s layout with header, sidebar navigation, and responsive mobile menu.",
  "frontend/src/components/related/EditLinksButton.tsx": "Simple button component for triggering link-editing actions.",
  "frontend/src/components/related/EditRelatedDialog.tsx": "Dialog for editing related entity links, handling loading states, errors, and saving selected IDs.",
  "frontend/src/components/related/MultiSelectList.tsx": "Filtered multi-select UI list with checkboxes and search input for choosing entity IDs.",
  "frontend/src/components/related/relatedRecordsPermissions.ts": "Permission helpers determining whether a user can edit various record types based on identity and ownership.",
  "frontend/src/components/related/RelatedRecordsSection.tsx": "Displays linked entity records with label resolution based on user permissions and retrieved caller data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to user identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches current user role and approval status using the actor, exposing admin and loading flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useLinkableEntityOptions.ts": "Builds linkable entity option lists for admins or non-admins, normalizing data and exposing loading/error states.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, roles, approvals, memberships, and related backend entities using the app’s actor interface.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for light and dark themes with a warm neutral palette.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it in Internet Identity and React Query providers.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with branding, sign‑in flow, and service descriptions, redirecting authenticated users to the portal.",
  "frontend/src/pages/portal/admin/AdminBootstrapPage.tsx": "Explains how to bootstrap the first admin using a secret token passed in the URL and Internet Identity sign‑in.",
  "frontend/src/pages/portal/admin/AdminDashboardPage.tsx": "Admin dashboard showing counts and recent items across memberships, works, releases, projects, and artist development, with access control.",
  "frontend/src/pages/portal/admin/RoleAssignmentPage.tsx": "Admin interface for viewing known users and assigning roles with mutation handling and role‑based access checks.",
  "frontend/src/pages/portal/artists/ArtistDevelopmentDetail.tsx": "Displays a detailed artist development entry with normalized fields, permission-aware editing, and related-entity linking.",
  "frontend/src/pages/portal/artists/ArtistDevelopmentPage.tsx": "Lists all artist development entries and provides an admin-only dialog to create new entries.",
  "frontend/src/pages/portal/label/ReleaseDetail.tsx": "Shows detailed release information, normalizes array fields, and supports permission-based editing of related entities.",
  "frontend/src/pages/portal/label/ReleasesPage.tsx": "Displays all label releases with an admin dialog for creating new releases using simple comma‑separated form inputs.",
  "frontend/src/pages/portal/memberships/MembershipDetail.tsx": "Renders membership details with editable profile fields, normalized arrays, and controls for linking related entities.",
  "frontend/src/pages/portal/memberships/MembershipsPage.tsx": "Displays all membership profiles with status badges and allows admins to create new memberships via a dialog form.",
  "frontend/src/pages/portal/publishing/PublishingWorkDetail.tsx": "Shows detailed information for a publishing work, including notes and linked entities, with editing options for authorized users.",
  "frontend/src/pages/portal/publishing/PublishingWorksPage.tsx": "Lists all publishing works and provides an admin dialog to create new works with contributors and ownership splits.",
  "frontend/src/pages/portal/recordings/RecordingProjectDetail.tsx": "Displays a single recording project's details and related links with editing available to permitted users.",
  "frontend/src/pages/portal/recordings/RecordingProjectsPage.tsx": "Shows a list of recording projects and allows admins to create new projects with participants and session data.",
  "frontend/src/utils/arrays.ts": "Provides utility functions to safely normalize, inspect, and handle array-like values from backend data.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters from query or hash, persist them in sessionStorage, and clear stored or hash parameters.",
  "frontend/src/utils/validation.ts": "Validates an array of ownership splits, ensuring the total percentage is between 0 and 100.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, fonts, animations, and plugins for the frontend.",
  "frontend/UPGRADE_LINKING_VERIFICATION.md": "Manual QA checklist for verifying upgrade-safe related-record linking across all detail pages for admin and non-admin roles.",
  "project_state.json": "Captures the project's current state, including features, requirements, notes, known issues, and version metadata."
}