{
  "kind": "build_request",
  "title": "Add named step documentation for ongoing rollout",
  "projectName": "Higgins Music Hub",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-64",
      "text": "Step 8 — Create a single source of truth document that names each remaining rollout step and briefly describes what will be done in that step (in English), so the team can track progress and refer to steps by name.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Move forward with the next step and remember to name each step for us. Thanks"
        ]
      },
      "acceptanceCriteria": [
        "A new markdown document exists in the repo that lists rollout steps with explicit step numbers and step names (e.g., \"Step 8 — …\", \"Step 9 — …\").",
        "Each step entry includes a short English description of what the step delivers and how to verify completion.",
        "The document clearly indicates which step is next to execute."
      ]
    },
    {
      "id": "REQ-65",
      "text": "Step 9 — Update the existing manual verification checklist at frontend/UPGRADE_LINKING_VERIFICATION.md to include a clear human-readable step name for the checklist (and/or each major section) so it is easy to reference during the named-step rollout process.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Move forward with the next step and remember to name each step for us. Thanks"
        ]
      },
      "acceptanceCriteria": [
        "frontend/UPGRADE_LINKING_VERIFICATION.md includes an explicit step name near the top (for example, a heading like \"Step X — <Name>\").",
        "All additions use English and do not change the existing verification meanings/URLs/button labels (e.g., \"Edit Links\")."
      ]
    }
  ],
  "constraints": [
    "Respect the existing single-actor Motoko backend architecture (do not introduce additional canisters/services).",
    "Do not edit files under frontend/src/components/ui or any other frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text added or modified."
  ],
  "nonGoals": [
    "No new entity types or schema changes.",
    "No changes to authentication/authorization behavior.",
    "No new UI pages or navigation items unless explicitly required by the step-naming documentation work."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}