{
  "kind": "build_request",
  "title": "Advance rollout guidance to Step 10 (Deployment and Launch)",
  "projectName": "Higgins Music Hub",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-109",
      "text": "Update `frontend/ROLLOUT_STEPS.md` so the \"Next Step to Execute\" section advances from Step 9.5 (Rollout 21.7 Build/Upgrade Execution) to Step 10 (Deployment and Launch), using clear English instructions and referencing any relevant existing checklists/log templates where appropriate.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes, move on to the next rollout step"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/ROLLOUT_STEPS.md` \"Next Step to Execute\" no longer lists Step 9.5 as the current step.",
        "The new \"Current Step\" is Step 10 — Deployment and Launch.",
        "The \"Action Required\" text is clear, concrete, and written in English, and it references existing project documents when applicable (e.g., existing smoke test and results templates)."
      ]
    },
    {
      "id": "REQ-110",
      "text": "Create a new Step 10 post-deployment smoke-test checklist document (Markdown) that can be used to validate the deployed app on mainnet/production, covering: landing page load (`/`), authentication/portal access (AuthGate + ApprovalGate), all five portal detail routes, and opening the \"Edit Links\" dialog on each detail page for both an Admin user and a non-admin approved Member user.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes, move on to the next rollout step"
        ]
      },
      "acceptanceCriteria": [
        "A new Markdown checklist file exists under `frontend/` with a name that clearly indicates Step 10 and smoke testing (e.g., includes \"STEP_10\" and/or \"SMOKE_TEST\").",
        "The checklist is written entirely in English and mirrors the coverage expectations used in the existing rollout smoke-test documents (landing page, AuthGate/ApprovalGate, five detail routes, and \"Edit Links\" dialog for both roles).",
        "The checklist includes explicit places to record the principals used and the entity IDs tested (similar to the Rollout 21.7 smoke test format)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (read-only UI component sources must be composed, not edited).",
    "Do not edit any files listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add or change application features beyond rollout documentation/checklists.",
    "Do not change backend state, Motoko schema, or migration behavior as part of this step."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}