{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Named rollout step documentation (Steps 8–9)",
  "requirements": [
    {
      "id": "REQ-64",
      "summary": "Create a single source of truth markdown document naming each remaining rollout step with brief descriptions and verification guidance, and indicate the next step to execute.",
      "acceptanceCriteria": [
        "A new markdown document exists in the repo that lists rollout steps with explicit step numbers and step names (e.g., \"Step 8 — …\", \"Step 9 — …\").",
        "Each step entry includes a short English description of what the step delivers and how to verify completion.",
        "The document clearly indicates which step is next to execute."
      ],
      "file_operations": [
        {
          "path": "frontend/ROLLOUT_STEPS.md",
          "operation": "create",
          "description": "Add a named-step rollout tracker document for Higgins Music Hub. Include: (1) a numbered list with explicit headings like \"Step 8 — <Name>\", \"Step 9 — <Name>\", etc. for the remaining rollout steps; (2) for each step, a short English description of what will be done and a concise \"How to verify\" checklist; (3) a clear marker stating the next step to execute (expected: Step 9 after this document is created)."
        }
      ]
    },
    {
      "id": "REQ-65",
      "summary": "Add a clear human-readable named-step heading to the existing manual verification checklist so it is easy to reference during the named-step rollout process.",
      "acceptanceCriteria": [
        "frontend/UPGRADE_LINKING_VERIFICATION.md includes an explicit step name near the top (for example, a heading like \"Step X — <Name>\").",
        "All additions use English and do not change the existing verification meanings/URLs/button labels (e.g., \"Edit Links\")."
      ],
      "file_operations": [
        {
          "path": "frontend/UPGRADE_LINKING_VERIFICATION.md",
          "operation": "modify",
          "description": "Update the top of the checklist to include an explicit named rollout step heading (e.g., \"Step 9 — Verify upgrade-safe related-record linking (Manual QA)\") near the beginning. Optionally add concise named headings for major sections to improve referenceability, without changing the existing checklist semantics, URLs, or UI labels such as \"Edit Links\"."
        }
      ]
    }
  ]
}