{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Higgins Music Hub — Step 10 rollout documentation updates",
  "requirements": [
    {
      "id": "REQ-109",
      "summary": "Advance ROLLOUT_STEPS.md “Next Step to Execute” from Step 9.5 to Step 10 with clear deployment/launch instructions and references to existing templates.",
      "acceptanceCriteria": [
        "`frontend/ROLLOUT_STEPS.md` \"Next Step to Execute\" no longer lists Step 9.5 as the current step.",
        "The new \"Current Step\" is Step 10 — Deployment and Launch.",
        "The \"Action Required\" text is clear, concrete, and written in English, and it references existing project documents when applicable (e.g., existing smoke test and results templates)."
      ],
      "file_operations": [
        {
          "path": "frontend/ROLLOUT_STEPS.md",
          "operation": "modify",
          "description": "Update the “Next Step to Execute” section to set **Current Step: Step 10 — Deployment and Launch** and replace the Action Required text with concrete, English deployment-and-launch guidance. Reference relevant existing docs/templates where appropriate, including: `frontend/ROLL_OUT_21_7_EXECUTION_LOG.md` (as an example of evidence capture), `frontend/UPGRADE_LINKING_VERIFICATION_RESULTS.md` (as the results format precedent), and the new Step 10 smoke-test checklist created in REQ-110. Keep changes limited to rollout documentation only."
        }
      ]
    },
    {
      "id": "REQ-110",
      "summary": "Create a Step 10 post-deployment smoke-test checklist (Markdown) for mainnet/production covering landing, AuthGate/ApprovalGate access, five detail routes, and Edit Links dialog checks for admin and non-admin approved member roles, with fields to record principals and entity IDs.",
      "acceptanceCriteria": [
        "A new Markdown checklist file exists under `frontend/` with a name that clearly indicates Step 10 and smoke testing (e.g., includes \"STEP_10\" and/or \"SMOKE_TEST\").",
        "The checklist is written entirely in English and mirrors the coverage expectations used in the existing rollout smoke-test documents (landing page, AuthGate/ApprovalGate, five detail routes, and \"Edit Links\" dialog for both roles).",
        "The checklist includes explicit places to record the principals used and the entity IDs tested (similar to the Rollout 21.7 smoke test format)."
      ],
      "file_operations": [
        {
          "path": "frontend/SMOKE_TEST_STEP_10_MAINNET.md",
          "operation": "create",
          "description": "Create a new Step 10 post-deployment smoke-test checklist for mainnet/production. Mirror the structure and coverage of existing smoke test docs (notably `frontend/SMOKE_TEST_21_7.md` and the role-based expectations). Include explicit record sections for: environment/app URL, admin principal + profile name, non-admin approved member principal + profile name, and the exact entity IDs tested for each of the five portal detail routes (`/portal/memberships/$id`, `/portal/publishing/$id`, `/portal/releases/$id`, `/portal/recordings/$id`, `/portal/artists/$id`). Checklist must include: landing page load (`/`), authentication/portal access verification (AuthGate + ApprovalGate), all five detail routes load, and opening the “Edit Links” dialog on each detail page—performed for both roles. Add a section to capture console errors/traps text. Keep wording entirely in English."
        }
      ]
    }
  ]
}