{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rollout 21.7 frontend build/upgrade verification and smoke-test documentation",
  "requirements": [
    {
      "id": "REQ-93",
      "summary": "Run Rollout 21.7 build/upgrade steps (Step 9.5) and capture frontend build evidence needed for successful deployment validation.",
      "acceptanceCriteria": [
        "Frontend TypeScript check completes successfully (`npm run typescript-check` in `frontend/`).",
        "Frontend production build completes successfully (`npm run build` in `frontend/`).",
        "Backend build completes successfully with no Motoko compiler errors.",
        "Canister upgrade completes successfully while preserving existing state (no data loss).",
        "Deployment pipeline completes successfully with no platform error \"Unable to create your app\".",
        "Application starts after upgrade with no runtime traps on startup."
      ],
      "file_operations": [
        {
          "path": "frontend/ROLL_OUT_21_7_EXECUTION_LOG.md",
          "operation": "modify",
          "description": "Record timestamped execution evidence for Rollout 21.7 Step 9.5, including the outputs/status for `npm run typescript-check` and `npm run build`, and notes confirming the deploy pipeline completed without the platform error \"Unable to create your app\"."
        },
        {
          "path": "frontend/ROLLOUT_STEPS.md",
          "operation": "modify",
          "description": "Ensure Step 9.5 references the required execution evidence artifacts (execution log + results template) and explicitly calls out verifying the frontend router-level error handling remains stable during post-upgrade validation."
        }
      ]
    },
    {
      "id": "REQ-94",
      "summary": "Execute the Rollout 21.7 smoke test checklist for both admin and non-admin approved member roles and ensure the checklist/log templates fully cover required validation points.",
      "acceptanceCriteria": [
        "Smoke test is executed end-to-end as an admin user following `frontend/SMOKE_TEST_21_7.md`.",
        "Smoke test is executed end-to-end as a non-admin approved member following `frontend/SMOKE_TEST_21_7.md`.",
        "For both roles: landing page (`/`) loads, authentication completes, portal layout renders, all five detail routes load without crashes, and the \"Edit Links\" dialog opens on each detail page.",
        "During testing, browser console shows no frontend errors related to undefined/null access; if any errors occur, they are captured verbatim for reporting."
      ],
      "file_operations": [
        {
          "path": "frontend/SMOKE_TEST_21_7.md",
          "operation": "modify",
          "description": "Complete/repair the Rollout 21.7 smoke test checklist so it fully includes the router error-handling verification steps and the explicit requirement to run the checklist twice (admin + non-admin approved member). This testing relies on the authorization component (role-based access control) and user-approval component (approved-member gating); verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/SMOKE_TEST_21_7_SESSION_LOG.md",
          "operation": "modify",
          "description": "Align the session log template with `SMOKE_TEST_21_7.md` so it captures, for both roles: the five detail-route entity IDs, confirmation that the \"Edit Links\" dialog opens on each page, and verbatim console error text/stack traces when present. This testing relies on the authorization component (admin vs user) and user-approval component (approved member access); verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-95",
      "summary": "Record Rollout 21.7 smoke-test outcomes in the designated results section with clear PASS/FAIL, principals, route IDs, and failure details when applicable.",
      "acceptanceCriteria": [
        "`frontend/UPGRADE_LINKING_VERIFICATION_RESULTS.md` has the “Rollout 21.7 Smoke Test Results” section filled in with: test date, tester, environment, build/upgrade status checkboxes, both test user principals, and the entity IDs used for each of the five routes for each role.",
        "If any failures occurred, the results include (at minimum) the failing route, the user role, and the exact observed error text (and stack trace if available).",
        "Overall result is marked PASS only if all smoke test steps completed successfully for both roles; otherwise marked FAIL with failure details recorded."
      ],
      "file_operations": [
        {
          "path": "frontend/UPGRADE_LINKING_VERIFICATION_RESULTS.md",
          "operation": "modify",
          "description": "Fill in the “Rollout 21.7 Smoke Test Results” section after executing the checklist, including test metadata, both principals, entity IDs for each of the five routes for each role, and verbatim error text/stack traces for any failures; mark PASS only if all steps pass for both roles."
        }
      ]
    }
  ]
}